### OpenTofu Plan (✅)

<details>
<summary>Click to expand plan output</summary>

```hcl
cloudflare_workers_kv_namespace.staging: Refreshing state... [id=7b26b313bfc14f109a40f0d965515b45]
cloudflare_r2_bucket.production: Refreshing state... [id=myamori-files]
cloudflare_d1_database.staging: Refreshing state... [id=879d824f-8972-4d44-93b1-6827f05ee360]
cloudflare_workers_kv_namespace.production: Refreshing state... [id=4fd22be90e8746e88c1fad24071b6648]
cloudflare_queue.staging: Refreshing state... [id=3518b4589c044719b37b076c4b297ce7]
cloudflare_r2_bucket.staging: Refreshing state... [id=myamori-files-staging]
cloudflare_d1_database.production: Refreshing state... [id=9e9124c8-ee72-408a-95b8-09e0a6c76ea8]
cloudflare_queue.production: Refreshing state... [id=d448b3a120f04bb6aced56c915a04ae1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # cloudflare_d1_database.production will be updated in-place
  ~ resource "cloudflare_d1_database" "production" {
      ~ created_at       = "2026-03-04T13:56:10Z" -> (known after apply)
      ~ file_size        = 114688 -> (known after apply)
        id               = "9e9124c8-ee72-408a-95b8-09e0a6c76ea8"
        name             = "myamori-db"
      ~ num_tables       = 8 -> (known after apply)
      - read_replication = {
          - mode = "disabled" -> null
        } -> null
      ~ version          = "production" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_d1_database.staging will be updated in-place
  ~ resource "cloudflare_d1_database" "staging" {
      ~ created_at       = "2026-03-04T13:56:10Z" -> (known after apply)
      ~ file_size        = 12288 -> (known after apply)
        id               = "879d824f-8972-4d44-93b1-6827f05ee360"
        name             = "myamori-db-staging"
      ~ num_tables       = 0 -> (known after apply)
      - read_replication = {
          - mode = "disabled" -> null
        } -> null
      ~ version          = "production" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

[Full workflow run](https://github.com/okayu9/myamori/actions/runs/22674042819)